OpenFOAM/thermofluid/tutorials/deprecatedTutorials/bubbleRiseInterFoamCase2/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha1 1
);

regions
(
    cylinderToCell
    {
        p1 (0.5 0.5 0); p2 (0.5 0.5 0.1); radius 0.25;
        fieldValues
        (
            volScalarFieldValue alpha1 0
        );
    }
);


// ************************************************************************* //
